Repository: pypi-data/pypi-mirror-289
Catalog: packages/django-spreadsheets/django_spreadsheets-1.1.0.tar.gz/django_spreadsheets-1.1.0/django_spreadsheets/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Spreadsheet
fr: Classeur

source: {config_name} template file.xlsx
fr: modèle import {config_name}.xlsx

source: Yes
fr: Oui

source: No
fr: Non

source: Sheet "{self.sheet_name}"
fr: Feuille « {self.sheet_name} »

source: {message}, cell {get_column_letter(self.column)}{self.row}
fr: {message}, cellule {get_column_letter(self.column)}{self.row}

source: The sheet "{self.sheet_name}" is missing
fr: La feuille « {self.sheet_name} » est manquante

source: The sheet "{self.sheet_name}" is missing from the file you supplied. Check that the sheet has not been deleted or renamed.
fr: La feuille « {self.sheet_name} » est manquante dans le fichier fourni. Veuillez vérifier que la feuille n’a pas été renommée ou supprimée.

source: The sheet "{self.sheet_name}" will be ignored when importing
fr: La feuille « {self.sheet_name} » sera ignorée lors de l’import

source: The sheet "{self.sheet_name}" in the file you have supplied does not correspond to a sheet in the template ({", ".join(self.config_sheets_names)}). It will be ignored.
fr: La feuille « {self.sheet_name} » dans le fichier fourni ne correspond à aucune feuille dans le modèle ({", ".join(self.config_sheets_names)}). Elle sera ignorée.

source: The column name does not match the model
fr: Le nom de la colonne ne correspond pas au modèle

source: {message} : the column name is "{self.column_header}" when it should be "{self.expected_column_header}"
fr: {message} : le nom de la colonne est « {self.column_header} » alors qu’il devrait être « {self.expected_column_header} »

source: {message}, column "{self.column_header}", type is invalid. {self.error_message}
fr: {message}, colonne « {self.column_header} », le type est invalide. {self.error_message}

source: Column "{self.column_header}" must be of the type: {self.expected_type}
fr: La colonne « {self.column_header} » doit être de type : {self.expected_type}

source: {message} : cell must no be empty
fr: {message} : la cellule ne doit pas être vide

source: Column "{self.column_header}" is required
fr: La colonne « {self.column_header} » est requise

source: {message} at least one of the columns "{self.column_header}" or "{self.unless_column_header}" must be completed
fr: {message} au moins une des colonne « {self.column_header} » ou « {self.unless_column_header} » doit être remplie

source: At least one of the columns "{self.column_header}" or "{self.unless_column_header}" must be completed
fr: Au moins une des colonnes « {self.column_header} » ou « {self.unless_column_header} » doit être remplie

source: {message} column "{self.column_header}" must be completed if column "{self.required_if_column_header}" is completed
fr: {message} la colonne « {self.column_header} » doit être remplie si la colonne « {self.required_if_column_header} » est remplie

source: Columns "{self.column_header}" and "{self.required_if_column_header}" must be completed
fr: Les colonnes « {self.column_header} » et « {self.required_if_column_header} » doivent être remplies

source: Line {self.line_number} is a duplicate of line {self.is_duplicate_of}
fr: La ligne {self.line_number} est un doublon de la ligne {self.is_duplicate_of}

source: Duplicated lines
fr: Lignes dupliquées

source: The object "{self.object}" will be deleted during import
fr: L’objet « {self.object} » sera supprimé lors de l’import

source: The object "{self.object}" will be deleted during import because it does not exist in the imported file.
fr: L’objet « {self.object} » sera supprimé lors de l’import car il n’existe pas dans le fichier fourni.

source: unknown
fr: inconnu

source: The configuration version of the file is incorrect
fr: La version de configuration du fichier est incorrecte

source: The configuration version of the file ({self.found}) is different from that expected ({self.expected})
fr: La version de configuration du fichier ({self.found}) est différente de celui attendu ({self.expected})

source: `{model_name}.{field_name}` received an unknown value: "{value}".
fr: `{model_name}.{field_name}` a reçu une valeur inconnue: « {value} ».

source: Choose a configuration
fr: Choisissez une configuration

source: File to import
fr: Fichier à importer

source: Your file must be formatted as in the template version {config_version}: <a href="{url}?config={config_name}">Download import file template version {config_version}</a>.
fr: Votre fichier doit être formaté comme le modèle version {config_version} : <a href="{url}?config={config_name}">Télécharger le modèle de fichier d’import version {config_version}</a>.

source: No file were provided.
fr: Aucun fichier n’a été fourni.

source: There are errors in the file. Please correct them and try importing the file again.
fr: Il y a des erreurs dans le fichier. Veuillez les corriger et essayer d’importer le fichier de nouveau.

source: Sheet "{sheet_title}", column "{column_header}" select an existing value corresponding to "{cell_value}"
fr: Feuille « {sheet_title} », colonne « {column_header} » choisissez une valeur existante correspondant à « {cell_value} »

source: Please select an existing element.
fr: Veuillez choisir une valeur existante.

source: Completed
fr: Terminé

source: The import is complete.
fr: L’import est terminé.

source: New import
fr: Nouvel import

source: Export
fr: Exporter

source: Start
fr: Démarrer

source: Import a file
fr: Importer un fichier

source: for
fr: pour

source: No errors or warnings identified in the file, click ‘Next’ to confirm data import.
fr: Aucune erreur ou avertissement trouvé dans le fichier, cliquez sur « Suivant » pour confirmer l’import des données.

source: Problems
fr: Problèmes

source: Sheet
fr: Feuille

source: Warnings
fr: Avertissements

source: General
fr: Général

source: warnings
fr: avertissements

source: Next
fr: Suivant

source: Step %(step_number)s/%(steps_total)s
fr: Étape %(step_number)s/%(steps_total)s

source: Import/Export
fr: Importer/Exporter

source: {count} items has been imported from sheet {sheet_name}.
fr: {count} éléments ont été importés depuis la feuille {sheet_name}.

source: No config found with name: "{config_name}"
fr: Aucune configuration trouvée avec le nom : « {config_name} »
